Revit 2024 API
UpdaterInfo.UpdaterName Property
 Name of the updater.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public string UpdaterName { get; }
Visual Basic
Public ReadOnly Property UpdaterName As String
	Get
Visual C++
public:
property String^ UpdaterName {
	String^ get ();
}
See Also
UpdaterInfo Class
Autodesk.Revit.DB Namespace